Move docs to doc s folder and update references
